# Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать. 
# Вводится список чисел. Все числа списка находятся на разных строках.

# from random import randint
# print(list_1:=[randint(0,15) for _ in range(int(input("Введите длину:")))])

# for i in range(len(list_1)):
#     for list_1[i] in range(len(list_1)):
#         if 
# +_+